In [7]:
import pandas as pd
import numpy as np

In [8]:
from sqlalchemy import create_engine

In [9]:
diccionario = {'A':[1,2,3], 'B':[4,5,6]}
dataframe = pd.DataFrame(diccionario)
dataframe

   A  B
0  1  4
1  2  5
2  3  6

In [10]:
engine = create_engine('sqlite:///:memory:')

In [11]:
dataframe.to_sql('tabla', engine, index=False)

3

In [14]:
datos_leidos_bd = pd.read_sql('tabla',con=engine)

In [15]:
datos_leidos_bd

   A  B
0  1  4
1  2  5
2  3  6